Autodesk.Revit.Creation.ItemFactoryBase.NewDimension(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.ReferenceArray,Autodesk.Revit.DB.DimensionType)
Creates a new linear dimension object using the specified dimension style.
view:  The view in which the dimension is to be visible.
line:  The line drawn for the dimension.
references:  An array of geometric references to which the dimension is to be bound.
dimensionType:  The dimension style to be used for the dimension.
Returns:  If successful a new dimension object, otherwise null.

Autodesk.Revit.Creation.ItemFactoryBase.NewDimension(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.ReferenceArray)
Creates a new linear dimension object.
Creates a new linear dimension object using the default dimension style.
view:  The view in which the dimension is to be visible.
line:  The line drawn for the dimension.
references:  An array of geometric references to which the dimension is to be bound.
Returns:  If successful a new dimension object, otherwise null.
Remarks:  The currently user set default style is used for the created dimension.